---
title: VertexPositionNormal
classe: Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: Autodesk.Revit.DB.DirectContext3D.Vertex
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# VertexPositionNormal

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ Normal { get; set; }` | `vertexPositionNormal.Normal` | XYZ |
| `XYZ Position { get; set; }` | `vertexPositionNormal.Position` | XYZ |
| `Int32 GetSizeInFloats()` | `VertexPositionNormal.GetSizeInFloats()` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```